Tekla Open API Reference for Tekla Structures 2025
ModelViewEnumerator.MoveNext Method
Moves to the next view in the enumerator.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool MoveNext()
Public Function MoveNext As Boolean
Return Value
Type: Boolean
False on failure.
Implements
IEnumerator.MoveNext()
See Also
Reference
ModelViewEnumerator Class
Tekla.Structures.Model.UI Namespace